; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p4---int100n150-m25---int100c150---s25---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level17 level57)
(sum level40 level21 level61)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level17 level58)
(sum level41 level21 level62)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level17 level59)
(sum level42 level21 level63)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level17 level60)
(sum level43 level21 level64)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level17 level61)
(sum level44 level21 level65)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level17 level62)
(sum level45 level21 level66)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level17 level63)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level17 level64)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level48 level17 level65)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level49 level17 level66)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level8 level59)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level8 level60)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level8 level61)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level8 level62)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level8 level63)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level8 level64)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level8 level65)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level8 level66)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level63 level3 level66)

(connected l0 l1)
(fuelcost level8 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l1 l0)
(fuelcost level8 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l1 l3)
(fuelcost level3 l1 l3)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)
(connected l2 l3)
(fuelcost level21 l2 l3)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l1)
(fuelcost level3 l3 l1)
(connected l3 l2)
(fuelcost level21 l3 l2)

(at t0 l3)
(fuel t0 level66)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l2)
(at p3 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 4
2. (drive t0 l3 l2 level45 level21 level66)
   deleted: (at t0 l3) (fuel t0 level66)
   added: (at t0 l2) (fuel t0 level45)
   goals met: 0 of 4
3. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 4
4. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 4
5. (drive t0 l2 l0 level28 level17 level45)
   deleted: (at t0 l2) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level28)
   goals met: 0 of 4
6. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 4
7. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 4
8. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 4
9. (drive t0 l0 l1 level20 level8 level28)
   deleted: (at t0 l0) (fuel t0 level28)
   added: (at t0 l1) (fuel t0 level20)
   goals met: 2 of 4
10. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 4
11. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 4 of 4
